tap "homebrew/bundle"
tap "homebrew/services"

# Homebrew
brew "awscli"
brew "git"
brew "carthage"
brew "elixir"
brew "figlet"
brew 'gpg'
brew 'gpg2'
brew 'gpg-agent'
brew "grep", args: ["with-default-names"]
tap "heroku/brew"
brew "heroku"
brew "mas"
brew "mongodb", restart_service: true
brew "node"
brew "openssl"
brew "pgcli"
brew "pinentry-mac"
brew "postgresql", restart_service: true
brew 'qt5'
brew "ruby-build"
brew "rbenv"
tap "thoughtbot/formulae"
brew "rcm"
brew "redis", restart_service: true
brew "the_silver_searcher"
brew "tig"
brew "tmux"
brew "tree"
brew "vim"
brew "wemux"
brew "z"
brew "zsh"

# Cask
tap "caskroom/cask"
cask_args appdir: '/Applications'
cask "alfred"
cask "charles"
cask "dash"
cask "dropbox"
cask "google-chrome"
cask "iterm2"
cask "knock"
cask "macid"
cask "screenhero"
cask "slack"
cask "spotify"
cask "steam"
cask "superduper"
cask "vlc"

# App Store
mas "DoublePane", id: 409737246
mas "Due", id: 524373870
mas "Moom", id: 419330170
mas "Sip", id: 507257563

# Apple Dev
mas "Xcode", id: 497799835
system "sudo xcodebuild -license accept"
brew "swiftlint"
