tap "homebrew/bundle"
tap "homebrew/services"

# Homebrew
brew "awscli"
brew "carthage"
brew "figlet"
brew "fzf"
brew "git"
tap "git-duet/tap"
brew "git-duet"
brew 'gnupg'
brew "grep", args: ["with-default-names"]
brew "imagemagick"
brew "mas"
brew "openssl"
brew "pgcli"
brew "pinentry-mac"
brew "postgresql", restart_service: true
brew 'qt5'
tap "thoughtbot/formulae"
brew "rcm"
brew "ripgrep"
brew "tig"
brew "tmux"
brew "tree"
brew "vim"
brew "wemux"
brew "yarn"
brew "z"
brew "zsh"

# Cask
tap "caskroom/cask"
cask_args appdir: '/Applications'
cask "alfred"
cask "charles"
cask "dash"
cask "dropbox"
cask "fantastical"
cask "google-chrome"
cask "kitty"
cask "slack"
cask "spotify"

# App Store
system "mas signin <email>"
mas "DoublePane", id: 409737246
mas "Due", id: 524373870
mas "Moom", id: 419330170
mas "Sip", id: 507257563
mas "Bear", id: 1091189122
mas "Things", id: 904280696
mas "Amphetamine", id: 937984704

# Apple Dev
mas "Xcode", id: 497799835
system "sudo xcodebuild -license accept"
