tap "homebrew/bundle"
tap "homebrew/services"

# Homebrew
brew "awscli"
brew "carthage"
brew "curl"
brew "diff-so-fancy"
brew "direnv"
brew "figlet"
brew "fzf"
brew "git"
tap "git-duet/tap"
brew "git-duet"
brew 'gnupg'
brew "grep", args: ["with-default-names"]
brew "imagemagick"
brew "libpq"
brew "mas"
brew "openssl"
brew "pgcli"
brew "pinentry-mac"
brew 'qt5'
tap "thoughtbot/formulae"
brew "rcm"
brew "ripgrep"
brew "tig"
brew "tmux"
brew "tree"
brew "vim"
brew "wemux"
brew "yarn"
brew "z"
brew "zsh"

# Cask
tap "homebrew/cask"
cask_args appdir: '/Applications'
cask "alfred"
cask "charles"
cask "dash"
cask "dropbox"
cask "fantastical"
# cask "google-chrome"
cask "karabiner-elements"
cask "keyboard-maestro"
cask "kitty"
cask "mutify"
cask "slack"
cask "spotify"
cask "tableplus"

# Apple Dev
# mas "Xcode", id: 497799835
# system "sudo xcodebuild -license accept"
